FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC546xx/LPC546xx_Serial.c
    p_info->iUART->MCR = (aControl & 0xFF);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine: LPC546xx_Serial_GetHandshakingStatus
 *---------------------------------------------------------------------------*
 * Description:
 *      Set the handshaking control for this serial port (if it has it)
 * Inputs:
 *      void *aWorkspace          -- Serial port workspace
 *      T_serialHandshakingStatus *aStatus -- Current status
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC546xx_Serial_GetHandshakingStatus(
        void *aWorkspace,
        T_serialHandshakingStatus *aStatus)
{
    T_Serial_LPC546xx_Workspace *p = (T_Serial_LPC546xx_Workspace *)aWorkspace;
    const T_Serial_LPC546xx_SerialInfo *p_info = p->iInfo;

    *aStatus = (p_info->iUART->MSR & 0xFF);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine: LPC546xx_Serial_GetStatus
 *---------------------------------------------------------------------------*
 * Description:
 *      Return the status of the port
 * Inputs:
 *      void *aWorkspace          -- Serial port workspace
 * Outputs:
 *      T_serialStatusByte          -- Status byte returned
 *---------------------------------------------------------------------------*/
T_serialStatusByte LPC546xx_Serial_GetStatus(void *aWorkspace)
{
    T_serialStatusByte status = 0;
    T_Serial_LPC546xx_Workspace *p = (T_Serial_LPC546xx_Workspace *)aWorkspace;

    // Only empty if both TEMT and THRE are empty
    if (p->iInfo->iUART->LSR & ((1 << 6) | (1 << 5))) {
        // not empty
    } else {
        status |= SERIAL_STATUS_TRANSMIT_EMPTY;
    }

    return status;
}

/*---------------------------------------------------------------------------*
 * Globals:
 *---------------------------------------------------------------------------*/
// List of serial port HAL interfaces
const HAL_Serial G_LPC546xx_Serial_UART0 = {
        {
        "Serial:LCP1788 UART0",
        0x0100,
        LPC546xx_Serial_InitializeWorkspace_UART0,
        sizeof(T_Serial_LPC546xx_Workspace),
        },

        LPC546xx_Serial_Configure,
        LPC546xx_Serial_SetSerialSettings,
        LPC546xx_Serial_GetSerialSettings,
        LPC546xx_Serial_Activate,
        LPC546xx_Serial_Deactivate,
        LPC546xx_Serial_OutputByte,
        0,
        0,
        LPC546xx_Serial_GetStatus, };

const HAL_Serial G_LPC546xx_Serial_UART1 = {
        {
        "Serial:LCP1788 UART1",
        0x0100,
        LPC546xx_Serial_InitializeWorkspace_UART1,
        sizeof(T_Serial_LPC546xx_Workspace),
        },

        LPC546xx_Serial_Configure,
        LPC546xx_Serial_SetSerialSettings,
        LPC546xx_Serial_GetSerialSettings,
        LPC546xx_Serial_Activate,
        LPC546xx_Serial_Deactivate,
        LPC546xx_Serial_OutputByte,
        LPC546xx_Serial_SetHandshakingControl,
        LPC546xx_Serial_GetHandshakingStatus,
        LPC546xx_Serial_GetStatus, };

const HAL_Serial G_LPC546xx_Serial_UART2 = {
        {
        "Serial:LCP1788 UART2",
        0x0100,
        LPC546xx_Serial_InitializeWorkspace_UART2,
        sizeof(T_Serial_LPC546xx_Workspace),
        },

        LPC546xx_Serial_Configure,
        LPC546xx_Serial_SetSerialSettings,
        LPC546xx_Serial_GetSerialSettings,
        LPC546xx_Serial_Activate,
        LPC546xx_Serial_Deactivate,
        LPC546xx_Serial_OutputByte,
        0,
        0,
        LPC546xx_Serial_GetStatus, };

const HAL_Serial G_LPC546xx_Serial_UART3 = {
        {
        "Serial:LCP1788 UART3",
        0x0100,
        LPC546xx_Serial_InitializeWorkspace_UART3,
        sizeof(T_Serial_LPC546xx_Workspace),
        },

        LPC546xx_Serial_Configure,
        LPC546xx_Serial_SetSerialSettings,
        LPC546xx_Serial_GetSerialSettings,
        LPC546xx_Serial_Activate,
        LPC546xx_Serial_Deactivate,
        LPC546xx_Serial_OutputByte,
        0,
        0,
        LPC546xx_Serial_GetStatus, };
	
const T_Serial_LPC546xx_SerialInfo G_LPC546xx_Serial_Info_UART0 = {
        USART0_IRQn,
        INTERRUPT_PRIORITY_HIGH,
        (T_16550UART *)LPC_USART0_BASE,
        (TISRFPtr)ISerialUART0,
        3, // PCUART0
        };

const T_Serial_LPC546xx_SerialInfo G_LPC546xx_Serial_Info_UART1 = {
        UART1_IRQn,
        INTERRUPT_PRIORITY_HIGH,
        (T_16550UART *)LPC_UART1_BASE,
        (TISRFPtr)ISerialUART1,
        4, // PCUART1
        };

const T_Serial_LPC546xx_SerialInfo G_LPC546xx_Serial_Info_UART2 = {
        USART2_IRQn,
        INTERRUPT_PRIORITY_HIGH,
        (T_16550UART *)LPC_USART2_BASE,
        (TISRFPtr)ISerialUART2,
        24, // PCUART2
        };

const T_Serial_LPC546xx_SerialInfo G_LPC546xx_Serial_Info_UART3 = {
        USART3_IRQn,
        INTERRUPT_PRIORITY_HIGH,
        (T_16550UART *)LPC_USART3_BASE,
        (TISRFPtr)ISerialUART3,
        25, // PCUART3
        };

/*---------------------------------------------------------------------------*
 * Requirement routines:
 *---------------------------------------------------------------------------*/
void LPC546xx_UART0_Require(
        T_uezGPIOPortPin aPinTXD0,
        T_uezGPIOPortPin aPinRXD0,
        T_uezGPIOPortPin aPinDIR0,
        T_uezGPIOPortPin aPinUCLK0)
{
    static const T_LPC546xx_SCU_ConfigList txd0[] = {
            {GPIO_P5_0,   SCU_NORMAL_DRIVE_DEFAULT(1)},
            {GPIO_P3_3,   SCU_NORMAL_DRIVE_DEFAULT(2)},
            {GPIO_P5_18,   SCU_NORMAL_DRIVE_DEFAULT(7)},
            {GPIO_P7_24,   SCU_NORMAL_DRIVE_DEFAULT(1)},
    };
    static const T_LPC546xx_SCU_ConfigList rxd0[] = {
            {GPIO_P5_1,   SCU_NORMAL_DRIVE_DEFAULT(1)},
            {GPIO_P3_4,   SCU_NORMAL_DRIVE_DEFAULT(2)},
            {GPIO_P7_25,   SCU_NORMAL_DRIVE_DEFAULT(1)},
            {GPIO_P4_11,   SCU_NORMAL_DRIVE_DEFAULT(7)},
    };
    static const T_LPC546xx_SCU_ConfigList dir0[] = {
            {GPIO_P5_6, SCU_NORMAL_DRIVE_DEFAULT(1)},
            {GPIO_P3_1, SCU_NORMAL_DRIVE_DEFAULT(2)},
            {GPIO_P7_23, SCU_NORMAL_DRIVE_DEFAULT(1)},
    };
    static const T_LPC546xx_SCU_ConfigList uclk0[] = {
            {GPIO_P5_2, SCU_NORMAL_DRIVE_DEFAULT(1)},
            {GPIO_P3_0, SCU_NORMAL_DRIVE_DEFAULT(2)},
            {GPIO_P7_22, SCU_NORMAL_DRIVE_DEFAULT(1)},
    };

    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("UART0", (T_halInterface *)&G_LPC546xx_Serial_UART0, 0,
            0);

    LPC546xx_SCU_ConfigPinOrNone(aPinTXD0, txd0, ARRAY_COUNT(txd0));
    LPC546xx_SCU_ConfigPinOrNone(aPinRXD0, rxd0, ARRAY_COUNT(rxd0));
    LPC546xx_SCU_ConfigPinOrNone(aPinDIR0, dir0, ARRAY_COUNT(dir0));
    LPC546xx_SCU_ConfigPinOrNone(aPinUCLK0, uclk0, ARRAY_COUNT(uclk0));
}

void LPC546xx_UART1_Require(
        T_uezGPIOPortPin aPinTXD1,
        T_uezGPIOPortPin aPinRXD1,
        T_uezGPIOPortPin aPinCTS,
        T_uezGPIOPortPin aPinDCD,
        T_uezGPIOPortPin aPinDSR,
        T_uezGPIOPortPin aPinDTR,
        T_uezGPIOPortPin aPinRI,
        T_uezGPIOPortPin aPinRTS)
{
    static const T_LPC546xx_SCU_ConfigList cts1[] = {
            {GPIO_P2_13 , SCU_NORMAL_DRIVE_DEFAULT(4)},
            {GPIO_P7_7  , SCU_NORMAL_DRIVE_DEFAULT(2)},
            {GPIO_P1_4  , SCU_NORMAL_DRIVE_DEFAULT(1)},
            {GPIO_P6_1  , SCU_NORMAL_DRIVE_DEFAULT(2)},
    };
    static const T_LPC546xx_SCU_ConfigList dcd1[] = {
            {GPIO_P1_5  , SCU_NORMAL_DRIVE_DEFAULT(1)},
            {GPIO_P2_14 , SCU_NORMAL_DRIVE_DEFAULT(4)},
            {GPIO_P6_10 , SCU_NORMAL_DRIVE_DEFAULT(2)},
            {GPIO_P7_9  , SCU_NORMAL_DRIVE_DEFAULT(2)},
    };
    static const T_LPC546xx_SCU_ConfigList dsr1[] = {
            {GPIO_P2_9  , SCU_NORMAL_DRIVE_DEFAULT(4)},
            {GPIO_P1_0  , SCU_NORMAL_DRIVE_DEFAULT(1)},
            {GPIO_P6_9  , SCU_NORMAL_DRIVE_DEFAULT(2)},
            {GPIO_P7_8  , SCU_NORMAL_DRIVE_DEFAULT(2)},
    };
    static const T_LPC546xx_SCU_ConfigList dtr1[] = {
            {GPIO_P1_1  , SCU_NORMAL_DRIVE_DEFAULT(1)},
            {GPIO_P2_10 , SCU_NORMAL_DRIVE_DEFAULT(4)},
            {GPIO_P6_11 , SCU_NORMAL_DRIVE_DEFAULT(2)},
            {GPIO_P7_10 , SCU_NORMAL_DRIVE_DEFAULT(2)},
    };
    static const T_LPC546xx_SCU_ConfigList ri1[] = {
            {GPIO_P1_3  , SCU_NORMAL_DRIVE_DEFAULT(1)},
            {GPIO_P2_12 , SCU_NORMAL_DRIVE_DEFAULT(4)},
            {GPIO_P6_0  , SCU_NORMAL_DRIVE_DEFAULT(2)},
            {GPIO_P7_6  , SCU_NORMAL_DRIVE_DEFAULT(2)},
    };
    static const T_LPC546xx_SCU_ConfigList rts1[] = {
            {GPIO_P1_2  , SCU_NORMAL_DRIVE_DEFAULT(1)},
            {GPIO_P2_11 , SCU_NORMAL_DRIVE_DEFAULT(4)},
            {GPIO_P6_2  , SCU_NORMAL_DRIVE_DEFAULT(2)},
            {GPIO_P7_5  , SCU_NORMAL_DRIVE_DEFAULT(2)},
    };
    static const T_LPC546xx_SCU_ConfigList rxd1[] = {
            {GPIO_P1_7  , SCU_NORMAL_DRIVE_DEFAULT(1)},
            {GPIO_P1_15 , SCU_NORMAL_DRIVE_DEFAULT(4)},
            {GPIO_P2_7  , SCU_NORMAL_DRIVE_DEFAULT(4)},
            {GPIO_P6_13 , SCU_NORMAL_DRIVE_DEFAULT(2)},
            {GPIO_P7_12 , SCU_NORMAL_DRIVE_DEFAULT(2)},
    };
    static const T_LPC546xx_SCU_ConfigList txd1[] = {
            {GPIO_P1_6  , SCU_NORMAL_DRIVE_DEFAULT(1)},
            {GPIO_P1_14 , SCU_NORMAL_DRIVE_DEFAULT(4)},
            {GPIO_P2_15 , SCU_NORMAL_DRIVE_DEFAULT(4)},
            {GPIO_P6_12 , SCU_NORMAL_DRIVE_DEFAULT(2)},
            {GPIO_P7_11 , SCU_NORMAL_DRIVE_DEFAULT(2)},
    };

    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("UART1", (T_halInterface *)&G_LPC546xx_Serial_UART1, 0,
            0);

    LPC546xx_SCU_ConfigPinOrNone(aPinTXD1, txd1, ARRAY_COUNT(txd1));
    LPC546xx_SCU_ConfigPinOrNone(aPinRXD1, rxd1, ARRAY_COUNT(rxd1));
    LPC546xx_SCU_ConfigPinOrNone(aPinCTS, cts1, ARRAY_COUNT(cts1));
    LPC546xx_SCU_ConfigPinOrNone(aPinDCD, dcd1, ARRAY_COUNT(dcd1));
    LPC546xx_SCU_ConfigPinOrNone(aPinDSR, dsr1, ARRAY_COUNT(dsr1));
    LPC546xx_SCU_ConfigPinOrNone(aPinDTR, dtr1, ARRAY_COUNT(dtr1));
    LPC546xx_SCU_ConfigPinOrNone(aPinRI, ri1, ARRAY_COUNT(ri1));
    LPC546xx_SCU_ConfigPinOrNone(aPinRTS, rts1, ARRAY_COUNT(rts1));
}

