FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC546xx/LPC546xx_Serial.c
void LPC546xx_UART2_Require(
        T_uezGPIOPortPin aPinTXD2,
        T_uezGPIOPortPin aPinRXD2,
        T_uezGPIOPortPin aPinDIR2,
        T_uezGPIOPortPin aPinUCLK2)
{
    static const T_LPC546xx_SCU_ConfigList dir2[] = {
            {GPIO_P0_13 , SCU_NORMAL_DRIVE_DEFAULT(1)},
            {GPIO_P1_13 , SCU_NORMAL_DRIVE_DEFAULT(7)},
    };
    static const T_LPC546xx_SCU_ConfigList rxd2[] = {
            {GPIO_P0_3  , SCU_NORMAL_DRIVE_DEFAULT(1)},
            {GPIO_P3_10 , SCU_NORMAL_DRIVE_DEFAULT(6)},
            {GPIO_P4_9  , SCU_NORMAL_DRIVE_DEFAULT(3)},
    };
    static const T_LPC546xx_SCU_ConfigList txd2[] = {
            {GPIO_P0_2  , SCU_NORMAL_DRIVE_DEFAULT(1)},
            {GPIO_P3_9  , SCU_NORMAL_DRIVE_DEFAULT(6)},
            {GPIO_P4_8  , SCU_NORMAL_DRIVE_DEFAULT(3)},
    };
    static const T_LPC546xx_SCU_ConfigList uclk2[] = {
            {GPIO_P0_12 , SCU_NORMAL_DRIVE_DEFAULT(1)},
            {GPIO_P1_12 , SCU_NORMAL_DRIVE_DEFAULT(7)},
    };

    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("UART2", (T_halInterface *)&G_LPC546xx_Serial_UART2, 0,
            0);
    LPC546xx_SCU_ConfigPinOrNone(aPinTXD2, txd2, ARRAY_COUNT(txd2));
    LPC546xx_SCU_ConfigPinOrNone(aPinRXD2, rxd2, ARRAY_COUNT(rxd2));
    LPC546xx_SCU_ConfigPinOrNone(aPinDIR2, dir2, ARRAY_COUNT(dir2));
    LPC546xx_SCU_ConfigPinOrNone(aPinUCLK2, uclk2, ARRAY_COUNT(uclk2));
}

void LPC546xx_UART3_Require(
        T_uezGPIOPortPin aPinTXD3,
        T_uezGPIOPortPin aPinRXD3,
        T_uezGPIOPortPin aPinBAUD3,
        T_uezGPIOPortPin aPinDIR3,
        T_uezGPIOPortPin aPinUCLK3)
{
    static const T_LPC546xx_SCU_ConfigList buad3[] = {
            {GPIO_P1_10 , SCU_NORMAL_DRIVE_DEFAULT(2)},
            {GPIO_P2_3  , SCU_NORMAL_DRIVE_DEFAULT(6)},
            {GPIO_P7_21 , SCU_NORMAL_DRIVE_DEFAULT(1)},
    };
    static const T_LPC546xx_SCU_ConfigList dir3[] = {
            {GPIO_P5_7  , SCU_NORMAL_DRIVE_DEFAULT(2)},
            {GPIO_P2_4  , SCU_NORMAL_DRIVE_DEFAULT(6)},
            {GPIO_P7_20 , SCU_NORMAL_DRIVE_DEFAULT(1)},
    };
    static const T_LPC546xx_SCU_ConfigList rxd3[] = {
            {GPIO_P1_11 , SCU_NORMAL_DRIVE_DEFAULT(2)},
            {GPIO_P5_4  , SCU_NORMAL_DRIVE_DEFAULT(2)},
            {GPIO_P2_2  , SCU_NORMAL_DRIVE_DEFAULT(6)},
            {GPIO_P5_17 , SCU_NORMAL_DRIVE_DEFAULT(7)},
            {GPIO_P7_18 , SCU_NORMAL_DRIVE_DEFAULT(1)},
    };
    static const T_LPC546xx_SCU_ConfigList txd3[] = {
            {GPIO_P0_14 , SCU_NORMAL_DRIVE_DEFAULT(2)},
            {GPIO_P5_3  , SCU_NORMAL_DRIVE_DEFAULT(2)},
            {GPIO_P2_1  , SCU_NORMAL_DRIVE_DEFAULT(6)},
            {GPIO_P4_15 , SCU_NORMAL_DRIVE_DEFAULT(7)},
            {GPIO_P7_17 , SCU_NORMAL_DRIVE_DEFAULT(1)},
    };
    static const T_LPC546xx_SCU_ConfigList uclk3[] = {
            {GPIO_P0_7  , SCU_NORMAL_DRIVE_DEFAULT(5)},
            {GPIO_P2_0  , SCU_NORMAL_DRIVE_DEFAULT(6)},
            {GPIO_P7_19 , SCU_NORMAL_DRIVE_DEFAULT(1)},
    };

    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("UART3", (T_halInterface *)&G_LPC546xx_Serial_UART3, 0,
            0);

    LPC546xx_SCU_ConfigPinOrNone(aPinTXD3, txd3, ARRAY_COUNT(txd3));
    LPC546xx_SCU_ConfigPinOrNone(aPinRXD3, rxd3, ARRAY_COUNT(rxd3));
    LPC546xx_SCU_ConfigPinOrNone(aPinBAUD3, buad3, ARRAY_COUNT(buad3));
    LPC546xx_SCU_ConfigPinOrNone(aPinDIR3, dir3, ARRAY_COUNT(dir3));
    LPC546xx_SCU_ConfigPinOrNone(aPinUCLK3, uclk3, ARRAY_COUNT(uclk3));
}

/*===========================================================================*
 * END OF FILE: SerialPorts.c
 *===========================================================================*/
